// Завдання: Конвертер одиниць температури

// Створіть компонент TemperatureConverter, який дозволяє користувачеві конвертувати температуру між шкалою Цельсія і Фаренгейта.

// Вимоги:

// Створіть компонент TemperatureConverter, який відображає два введення для температур, одне для введення в градусах Цельсія і інше для введення в градусах Фаренгейта.
// При зміні значення в одному з введень, відображення в іншому введенні повинно автоматично оновлюватись, використовуючи відповідну формулу конвертації.
// Використовуйте стан для збереження значень температур у компоненті.
// Це завдання допоможе вам вивчити, як використовувати setState() для оновлення відповідних частин стану, а також для взаємодії між різними полями введення та відображенням оновлених даних.

// const fahrenheitValue = (celsiusValue * 9 / 5) + 32;
// const celsiusValue = (fahrenheitValue - 32) * 5 / 9;
// івент.таргет.валуе